<h2> Pandas Practice </h2>
<b> Based on kernel </b>
https://www.kaggle.com/python10pm/pandas-75-exercises-with-solutions

<p style="color:tomato;">1. Import lib </p>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

<p style="color:tomato;">2. How to create a series from a list, numpy array and dict?</p>

In [4]:
lis1 = [1,2,66,'ff']
numarr1 = np.array([55,66,77,88,99])
dic1 = {'stu1':27,'stu2':43,'stu3':12,'stu4':97}

In [9]:
type(dic1)

dict

In [14]:
dic1.values()

dict_values([27, 43, 12, '97'])

In [15]:
s1 = pd.Series(lis1)         #will be assigned default index
s2 = pd.Series(numarr1)       #will be assigned default index

In [21]:
s3 = pd.Series(dic1.values(),index=dic1.keys())       # Not needed.
s4 = pd.Series(dic1)           #Index automatically obtained from dictionary keys

In [23]:
s3

stu1    (27, 43, 12, 97)
stu2    (27, 43, 12, 97)
stu3    (27, 43, 12, 97)
stu4    (27, 43, 12, 97)
dtype: object

In [22]:
s4

stu1    27
stu2    43
stu3    12
stu4    97
dtype: object

<p p style="color:tomato;">3 - How to convert the index of a series into a column of a dataframe?</p>

In [29]:
df_1 = pd.DataFrame(s4).reset_index()

In [32]:
df_1

  index   0
0  stu1  27
1  stu2  43
2  stu3  12
3  stu4  97

<p style="color:tomato;"> 4 - How to combine many series to form a dataframe? </p>

In [36]:
s1

0     1
1     2
2     3
3    ff
dtype: object

In [50]:
# LINK TO RENAMING COL NAMES USING DICTIONARY just to Remember
df_2 = pd.DataFrame({'c1':s1,'c2':s2})

In [51]:
df_2

    c1  c2
0    1  55
1    2  66
2    3  77
3   ff  88
4  NaN  99

<p style="color:tomato;">
5. Rename a Series index -- <b> <br/>This is essentially renaming the Series</b>
   <br/><br/>6. How to get the items of series A not present in series B? ** </p>

In [77]:
s1,s2

(0     1
 1     2
 2    66
 3    ff
 dtype: object, 0    55
 1    66
 2    77
 3    88
 4    99
 dtype: int32)

In [74]:
for i in s1:
    for j in s2:
        if i==j:
            print(i)
        else:
            continue

66

In [80]:
#But since Pandas is kind of vectorized
s1[s1.isin(s2)]

#but need to check on a large dataframe

2    66
dtype: object

In [82]:
s1[~s1.isin(s2)]  #  ~ is not inverse

0     1
1     2
3    ff
dtype: object

<p style="color:tomato;">
8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series? </p>

In [6]:
state = np.random.RandomState(100)     
#`RandomState` exposes a number of methods for generating random numbers
#drawn from a variety of probability distributions.

In [7]:
state

In [8]:
ser = pd.Series(state.normal(10, 5, 25))

In [15]:
ser.describe()

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

<p style="color:tomato;">
11 - How to bin a numeric series to 10 groups of equal size?

In [40]:
ser = pd.Series(np.random.random(20))

In [41]:
ser

0     0.694282
1     0.937822
2     0.210807
3     0.384721
4     0.476693
5     0.296263
6     0.658568
7     0.470919
8     0.623627
9     0.172108
10    0.159598
11    0.181228
12    0.605470
13    0.611085
14    0.591908
15    0.143741
16    0.347418
17    0.025843
18    0.904372
19    0.291489
dtype: float64

In [42]:
pd.qcut(ser,q = 10)

0      (0.631, 0.715]
1      (0.715, 0.938]
2      (0.179, 0.267]
3      (0.327, 0.428]
4      (0.428, 0.523]
5      (0.267, 0.327]
6      (0.631, 0.715]
7      (0.428, 0.523]
8      (0.607, 0.631]
9      (0.158, 0.179]
10     (0.158, 0.179]
11     (0.179, 0.267]
12     (0.523, 0.607]
13     (0.607, 0.631]
14     (0.523, 0.607]
15    (0.0248, 0.158]
16     (0.327, 0.428]
17    (0.0248, 0.158]
18     (0.715, 0.938]
19     (0.267, 0.327]
dtype: category
Categories (10, interval[float64]): [(0.0248, 0.158] < (0.158, 0.179] < (0.179, 0.267] < (0.267, 0.327] ... (0.523, 0.607] < (0.607, 0.631] < (0.631, 0.715] < (0.715, 0.938]]

<p style="color:tomato;">
    12 - How to convert a numpy array to a dataframe of given shape? (L1)

In [15]:
arr1 = np.array([[1,2,3,4],[22,33,44,55],[99,99,99,99]])

In [16]:
arr1.shape

(3, 4)

In [17]:
df_1 = pd.DataFrame(arr1,columns=['c1','c2','c3','c4'])

In [18]:
df_1

   c1  c2  c3  c4
0   1   2   3   4
1  22  33  44  55
2  99  99  99  99

<p style="color:tomato;">
13. How to find the positions of numbers that are multiples of 3 from a series?

In [76]:
del lis_t

In [54]:
ser = pd.Series(np.random.randint(2,28,14))

In [86]:
ser

0      5
1      6
2     19
3     25
4      9
5      9
6     11
7     23
8     24
9     27
10     6
11    23
12     2
13     7
dtype: int32

In [118]:

#lis1 = []
#for i in ser:
 #   if i%3==0:
  #      lis1.append(????????????)

In [90]:
np.argwhere(ser%3 == 0)     #deprecated

array([[ 1],
       [ 4],
       [ 5],
       [ 8],
       [ 9],
       [10]], dtype=int64)

In [91]:
np.nonzero(ser%3==0)

(array([ 1,  4,  5,  8,  9, 10], dtype=int64),)

<p style="color:tomato;">
17. How to compute the mean squared error on a truth and predicted series?

In [61]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [136]:
np.mean((truth-pred)**2)

0.4024830018569694

In [137]:
from sklearn.metrics import mean_squared_error
mean_squared_error(truth, pred)

0.4024830018569694

<p style="color:tomato;">
<b><i>map(lambda....)

In [10]:
ser_test = pd.Series(['just', 'some', 'random', 'words'])

In [11]:
ser_test

0      just
1      some
2    random
3     words
dtype: object

In [13]:
ser_test[1].upper()

'SOME'

In [194]:
ser_test.map(lambda x: x.upper())

0      JUST
1         A
2    RANDOM
3      LIST
dtype: object

<b>Another example

In [19]:
df_1

   c1  c2  c3  c4
0   1   2   3   4
1  22  33  44  55
2  99  99  99  99

In [25]:
df_1[:]['c2']

0     2
1    33
2    99
Name: c2, dtype: int32

In [26]:
df_1[:]['c2'].map(lambda x: x+1)

0      3
1     34
2    100
Name: c2, dtype: int64

In [29]:
df_1[['c1','c2','c3']]

   c1  c2  c3
0   1   2   3
1  22  33  44
2  99  99  99

In [31]:
df_1['c2'].apply(lambda x: x+1)

0      3
1     34
2    100
Name: c2, dtype: int64

In [34]:
df_1['c4'] = df_1['c2'].apply(lambda x: x+1)

In [36]:
df_1

   c1  c2  c3   c4
0   1   2   3    3
1  22  33  44   34
2  99  99  99  100

In [48]:
df_1.apply(lambda x: x+10)

    c1   c2   c3   c4
0   11   12   13   13
1   32   43   54   44
2  109  109  109  110

<p style="color:tomato;">
19.  How to calculate the number of characters in each word in a series?

In [62]:
ser_test

0      just
1      some
2    random
3     words
dtype: object

In [68]:
for i in ser_test:
    print(len(i))

4
4
6
5

<p style="color:tomato;">
20. How to compute difference of differences between consequtive numbers of a series?
    <br>running difference

In [69]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [109]:
del m

In [112]:
for m in range(0,len(ser)):
    if m==0:
        print('na')
    else:
        print(ser[m]-ser[m-1])

na
2
3
4
5
6
6
8

In [127]:
li=[]
def run_diff(ser_name):
    for i in range(0,len(ser_name)):
        if i==0:
            li.append('na')
        else:
            li.append(ser_name[i]-ser_name[i-1])
    return li

In [128]:
run_diff(ser)

['na', 2, 3, 4, 5, 6, 6, 8]

In [132]:
#OR Can use Pandas diff function
ser.diff(periods=1)

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64


#### <font color='tomato'> 21. How to convert a series of date-strings to a timeseries?

In [133]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [134]:
ser

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

In [135]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]


#### <font color='tomato'> 22. How to get the day of month, week number, day of year and day of week from a series of date strings?<font color='none'> sss

In [137]:
ser = pd.to_datetime(ser)

In [140]:
ser.describe()

count                       6
unique                      6
top       2012-03-03 00:00:00
freq                        1
first     2010-01-01 00:00:00
last      2015-06-06 12:20:00
dtype: object

In [141]:
ser

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [163]:
type(ser)

pandas.core.series.Series

In [166]:
pd.to_datetime(ser).dt.day

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

#### <font color='tomato'>26. How to get the mean of a series grouped by another series?